# Host: localhost  (Version 5.7.19-log)
# Date: 2018-02-27 15:49:45
# Generator: MySQL-Front 5.3  (Build 5.39)

/*!40101 SET NAMES utf8 */;

#
# Structure for table "co_msg"
#

CREATE TABLE `co_msg` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` int(11) DEFAULT NULL,
  `type` tinyint(3) DEFAULT '0',
  `battle_id` int(11) DEFAULT '0',
  `detail` text,
  `status` tinyint(3) DEFAULT '0' COMMENT '是否已读，0未读',
  `created_at` datetime DEFAULT NULL,
  `updated_at` datetime DEFAULT NULL,
  `is_battle` tinyint(3) DEFAULT '0' COMMENT '是否需要对战',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=12 DEFAULT CHARSET=utf8;

#
# Data for table "co_msg"
#

REPLACE INTO `co_msg` VALUES (1,1,5,3,'你在2018-02-26 16:22:23发起的1v1对战赛中，赢得了胜利',0,'2018-02-26 16:39:44','2018-02-26 16:39:44',0),(2,6,5,3,'你在 test 2018-02-26 16:22:23发起的1v1对战赛中，失败了，再接再厉哦',0,'2018-02-26 16:39:44','2018-02-26 16:39:44',0),(3,6,5,4,'test 在 2018-02-26 16:40:22 向你发起1v1挑战，快来对战吧~',0,'2018-02-26 16:40:22','2018-02-26 16:40:22',0),(4,1,5,4,'你在2018-02-26 16:40:22发起的1v1对战赛中，和对方旗鼓相当，不分上下~',0,'2018-02-26 16:41:46','2018-02-26 16:41:46',0),(5,6,5,4,'你在 test 2018-02-26 16:40:22发起的1v1对战赛中，和对方旗鼓相当，不分上下~',0,'2018-02-26 16:41:46','2018-02-26 16:41:46',0),(6,1,5,4,'你在2018-02-26 16:40:22发起的1v1对战赛中，和对方旗鼓相当，不分上下~',0,'2018-02-26 16:42:54','2018-02-26 16:42:54',0),(7,6,5,4,'你在 test 2018-02-26 16:40:22发起的1v1对战赛中，和对方旗鼓相当，不分上下~',0,'2018-02-26 16:42:55','2018-02-26 16:42:55',0),(8,1,5,4,'你在2018-02-26 16:40:22发起的1v1对战赛中，赢得了胜利',0,'2018-02-26 16:43:07','2018-02-26 16:43:07',0),(9,6,5,4,'你在 test 2018-02-26 16:40:22发起的1v1对战赛中，失败了，再接再厉哦',0,'2018-02-26 16:43:07','2018-02-26 16:43:07',0),(10,1,5,3,'抱歉，您的好友Jerry Zhang超过24小时未响应你的挑战，该挑战已失效。',0,'2018-02-26 09:19:26','2018-02-26 09:19:26',0),(11,1,5,3,'抱歉，您的好友Jerry Zhang超过24小时未响应你的挑战，该挑战已失效。',0,'2018-02-26 09:20:14','2018-02-26 09:20:14',0);
